<h1 style='text-align: center'>SQL Queries</h1>

## Getting Data From A SQL Database

### The Structure of a SQL Query

<img src='images/sql_statement.jpg'/>

#### SELECT

- What columns of data do we want? 
- Specify by column names or * (All)

FROM

- Where are we getting our data from? 
- Specify by table name or use join statement to join multiple tables

##### JOIN

- Use to join multiple tables 
- SELECT * FROM students join favorite_foods on students.id = favorite_foods.student_id
- SELECT * FROM students as s join favorite_foods as f on s.id = f.student_id

#### WHERE

- apply some filter to the data you are querying 
- define criteria for data that should selected from the database 
- SELECT * from students WHERE age > 10

#### GROUP BY

- Group columns by similar values
- SELECT COUNT(id), city from students GROUP BY city

#### HAVING

- Use to apply filter AFTER you have made your initial query 
- When should we use HAVING instead of WHERE

In [1]:
import sqlite3

conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

In [3]:
# Load students.json file

#your code here
import json
f=open('students.json','r')
data=json.load(f)

In [5]:
data[0]

{'name': 'Sean Abu Wilson',
 'birthdate': '02/06',
 'siblings': 2,
 'Birthplace': 'Birmingham, AL',
 'yearsinnyc': 7.8,
 'favoritefood': 'guacamole'}

In [ ]:
# iterate over the data and insert each student into the DB

In [44]:
#c.execute("""DROP TABLE students""")
c.execute('''
CREATE TABLE students (name TEXT, birthdate TEXT, siblings REAL, Birthplace TEXT, yearsinNYC REAL, favoritefood TEXT)''')

In [45]:
# dynamic data entry example
def dynamic_data_entry(person):
    c.execute('''INSERT INTO students (name, birthdate, siblings, Birthplace, yearsinnyc, favoritefood) VALUES (?, ?, ?, ?, ?, ?)''',
              (person['name'], person['birthdate'], person['siblings'], person['Birthplace'], 
               person['yearsinnyc'], person['favoritefood']))

    conn.commit()


# c.close
# conn.close()
#DROP TABLE STUDENT for extra lines

In [46]:
for person in data:
    dynamic_data_entry(person)

In [52]:
import pandas as pd 
c.execute("""SELECT * from students""")
d = pd.DataFrame(c.fetchall())
d.columns = [x[0] for x in c.description]
d

,name,birthdate,siblings,Birthplace,yearsinNYC,favoritefood
0,Sean Abu Wilson,02/06,2.0,"Birmingham, AL",7.8,guacamole
1,Tawab,04/08/1998,4.0,Afghanistan,0.5,pizza
2,Bridget Boakye,1990-07-13,3.0,Accra,15.0,Indian
3,Cristina,9/9/1990,2.0,Spain,6.0,Sushi
4,Danny (Haoyang) Yu,1997-03-19,2.0,1997-03-19,0.0,Galbi
5,Dustin_Breitner,04/15/94,2.0,New_York,3.0,Pizza
6,Gregory DeSantis,1987-11-23,2.0,"Highland Park, NJ",13.0,Pizza
7,Harrison Miller,10/2/85,0.0,New Jersey,0.0,Pizza
8,Jeremy Owens,03/30/1990,0.0,Virginia,6.0,Avocado
9,Jeremy Reikes,1-/12/1995,1.0,New York City,23.0,Pizza
10,Johnathan Peck,02-19-1994,2.0,New York,25.0,Moms food
11,Minna F,11-19-1996,3.0,San Francisco,1.0,sushi
12,Nabil Abbas,12-07-1994,2.0,Long Island,6.0,Gyro
13,Natalie Del Rossi,10-23-1994,0.0,Brooklyn,18.0,pizza
14,Remy Canario,10-11-1988,0.0,New York,28.0,toast
15,Xristos Katsaros,03-24-1986,1.0,"Chicago Heights, IL",3.0,Pizza

In [ ]:
# dynamic data entry example
def dynamic_data_entry():
    c.execute("INSERT INTO stuffToPlot (unix, datestamp, keyword, value) VALUES (?, ?, ?, ?)",
          (unix, date, keyword, value))

    conn.commit()

# c.close
# conn.close()

### Questions
1. What are the names of all of the students?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
6. Do any two students have the same favorite food?
7. Which student was born closest to the cohort's graduation date?

In [48]:
c.execute("""SELECT name FROM students""").fetchall()

[('Sean Abu Wilson',),
 ('Tawab',),
 ('Bridget Boakye',),
 ('Cristina',),
 ('Danny (Haoyang) Yu',),
 ('Dustin_Breitner',),
 ('Gregory DeSantis',),
 ('Harrison Miller',),
 ('Jeremy Owens',),
 ('Jeremy Reikes',),
 ('Johnathan Peck',),
 ('Minna F',),
 ('Nabil Abbas',),
 ('Natalie Del Rossi',),
 ('Remy Canario',),
 ('Xristos Katsaros',)]

In [49]:
c.execute("""SELECT name FROM students WHERE siblings = (SELECT max(siblings) FROM students)""").fetchall()

[('Tawab',)]

In [68]:
c.execute("""SELECT COUNT(name) FROM students WHERE siblings = 0""").fetchall()

[(4,)]

In [64]:
c.execute("""SELECT name FROM students WHERE yearsinnyc = (SELECT min(yearsinnyc) FROM students)""").fetchall()

[('Danny (Haoyang) Yu',), ('Harrison Miller',)]